RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_sar.h
/** For PASS_V2 the SAR clock can come from:
*   - one of the CLK_PERI dividers
*   - PASS Deep Sleep Clock (CLK_DPSLP)
*/
typedef enum
{
    CY_SAR_CLK_PERI       = 0UL,    /**< SAR clock source is one of \ref group_sysclk "PERI" dividers (SAR is only operational in chip ACTIVE mode) */
    CY_SAR_CLK_DEEPSLEEP  = 1UL     /**< SAR clock source is \ref group_sysanalog_dpslp "CLK_DPSLP" (SAR can be operational in both chip ACTIVE and DEEPSLEEP modes) */
} cy_en_sar_clock_source_t;

/** Definitions for simultaneous scan trigger signal event selection */
typedef enum
{
    CY_SAR_SIMULT_TRIG_EVENT_EDGE   = 0UL, /**< Positive edge detected on the trigger signal triggers a new scan */
    CY_SAR_SIMULT_TRIG_EVENT_LEVEL  = 1UL, /**< SAR will do continuous scans as long as the trigger signal remains high */
} cy_en_sar_simult_trig_event_sel_t;

/** Definitions for simultaneous scan trigger synchronization */
typedef enum
{
    CY_SAR_SIMULT_TRIG_SYNC_NONE      = 0UL, /**< Bypass clock domain synchronization of the simultaneous trigger signal */
    CY_SAR_SIMULT_TRIG_SYNC_SAR_CLOCK = 1UL, /**< Synchronize the simultaneous trigger signal to the SAR clock domain */
} cy_en_sar_simult_trig_sync_sel_t;

/** Definitions for simultaneous scan sampling mode */
typedef enum
{
    CY_SAR_SIMULT_TRIG_SAMPLE_SINGLE     = 0UL, /**< Perform single scan on the trigger event */
    CY_SAR_SIMULT_TRIG_SAMPLE_SCAN_CNT   = 1UL, /**< On the trigger event perform number of scans, specified by scanCount */
} cy_en_sar_simult_trig_sample_sel_t;

/** Definitions for simultaneous scan interrupt generation */
typedef enum
{
    CY_SAR_SIMULT_TRIG_INTR_EOS       = 0UL, /**< Generate interrupt on each End of Sample event */
    CY_SAR_SIMULT_TRIG_INTR_SCAN_CNT  = 1UL, /**< Generate interrupt on End of Sample event only when sample number = scanCount */
}cy_en_sar_simult_trig_intr_sel_t;

/** \} group_sar_enums */

/** \addtogroup group_sar_data_structures
* \{
*/

/***************************************
*       Configuration Structures
***************************************/

/** FIFO configuration structure **/
typedef struct
{
    bool chanId;                                        /**< Enable the channel ID in the results */
    bool chainToNext;                                   /**< Chain the FIFO to the next FIFO */
    bool clrTrIntrOnRead;                               /**< Enable the FIFO level trigger (and optional level interrupt) clearing on FIFO read */
    uint32_t level;                                     /**< A trigger (and optional interrupt) event occurs when the number of FIFO entries overcomes the Level setting. Range: 1..256 */
    bool trOut;                                         /**< SAR output trigger is set by the 'level' condition */
} cy_stc_sar_fifo_config_t;


/** This structure is used to initialize the SAR ADC subsystem.
*
* The SAR ADC subsystem is highly configurable with many options.
* When calling \ref Cy_SAR_Init, provide a pointer to the structure containing this configuration data.
* A set of enumerations is provided in this
* driver to help with configuring this structure.
*
* See the \ref group_sar_initialization section for guidance.
**/
typedef struct
{
    uint32_t ctrl;                                      /**< Control register settings (applies to all channels) */
    uint32_t sampleCtrl;                                /**< Sample control register settings (applies to all channels) */
    uint32_t sampleTime01;                              /**< Sample time in ADC clocks for Sample Time 0 and 1 */
    uint32_t sampleTime23;                              /**< Sample time in ADC clocks for Sample Time 2 and 3 */
    uint32_t rangeThres;                                /**< Range detect threshold register for all channels */
    cy_en_sar_range_detect_condition_t rangeCond;       /**< Range detect condition (below, inside, output, or above) for all channels */
    uint32_t chanEn;                                    /**< Enable bits for the channels */
    uint32_t chanConfig[CY_SAR_NUM_CHANNELS];           /**< Channel configuration */
    uint32_t intrMask;                                  /**< Interrupt enable mask */
    uint32_t satIntrMask;                               /**< Saturation detection interrupt enable mask */
    uint32_t rangeIntrMask;                             /**< Range detection interrupt enable mask  */
    uint32_t muxSwitch;                                 /**< SARMUX firmware switches to connect analog signals to SAR */
    uint32_t muxSwitchSqCtrl;                           /**< Enable SARSEQ control of specific SARMUX switches */
    bool configRouting;                                 /**< Configure or ignore routing related registers (muxSwitch, muxSwitchSqCtrl) */
    uint32_t vrefMvValue;                               /**< Reference voltage in millivolts used in converting counts to volts */
    cy_en_sar_clock_source_t clock;                     /**< Clock source selection (enable/disable SAR operation in the Deep Sleep mode). Ignored for PASS_ver1. */
    cy_stc_sar_fifo_config_t const * fifoCfgPtr;        /**< Pointer to the FIFO configuration structure \ref cy_stc_sar_fifo_config_t, if NULL - the FIFO is not used. Should be NULL for PASS_ver1. */
    bool trTimer;                                       /**< SAR is being triggered from the Timer \ref group_sysanalog_timer . Ignored for PASS_ver1. */
    bool scanCnt;                                       /**< Enable the scanning counter, configured by \ref Cy_SAR_CommonInit. Ignored for PASS_ver1. */
    bool scanCntIntr;                                   /**< EOS interrupt on scanning counter event. Ignored for PASS_ver1. */
} cy_stc_sar_config_t;

/** SAR triggering configuration structure */
typedef struct
{
    uint32_t                            pwrUpDelay;              /**< Power up delay for SAR blocks in Deep Sleep Clock cycles. Range 0..255. */
    uint32_t                            scanCount;               /**< Configures the number of samples SAR will take when triggered. Range 1..256. */
    uint32_t                            simultControl;           /**< Configures the SAR ADCs for simultaneous control. The value is a combined mask, created using following macros:
                                                                  * - CY_SAR_SAR0
                                                                  * - CY_SAR_SAR1
                                                                  * - CY_SAR_SAR2
                                                                  * - CY_SAR_SAR3
                                                                  * See \ref group_sysanalog_sar_select
                                                                  */
    uint32_t                            simultTrigSource;        /**< Configures the trigger source for simultaneous SAR hardware trigger. Use one of the following values:
                                                                  * - CY_SAR_SAR0
                                                                  * - CY_SAR_SAR1
                                                                  * - CY_SAR_SAR2
                                                                  * - CY_SAR_SAR3
                                                                  * - CY_SAR_TIMER
                                                                  * See \ref group_sysanalog_sar_select
                                                                  */
    cy_en_sar_simult_trig_event_sel_t   simultTrigEvent;         /**< Configures simultaneous trigger signal event */
    cy_en_sar_simult_trig_sync_sel_t    simultTrigSync;          /**< Enables synchronization of trigger signal */
    cy_en_sar_simult_trig_sample_sel_t  simultSamplesPerTrigger; /**< Configures scan sampling mode for each trigger event */
    cy_en_sar_simult_trig_intr_sel_t    simultEOSIntrSelect;     /**< Configures EOS interrupt condition */
}cy_stc_sar_common_config_t ;

/** This structure is used by the driver to backup the state of the SAR
* before entering sleep so that it can be re-enabled after waking up */
typedef struct
{
    uint32_t hwEnabled;                                 /**< SAR enabled state */
    uint32_t continuous;                                /**< State of the continuous bit */
} cy_stc_sar_state_backup_t;

/** Structure to read the FIFO buffer */
typedef struct
{
    uint16_t   value; /**< SAR sample */
    uint16_t channel; /**< SAR channel */
} cy_stc_sar_fifo_read_t;

/** \} group_sar_data_structures */

/** \addtogroup group_sar_functions
* \{
*/

/** This macro is for backward compatibility macro for driver v1.10 and before,
 * the preferred API is \ref Cy_SAR_DeepSleep */
#define Cy_SAR_Sleep    Cy_SAR_DeepSleep

