RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_sar.h
/** \addtogroup group_sar_functions_helper
* \{
*/


/*******************************************************************************
* Function Name: Cy_SAR_IsChannelDifferential
****************************************************************************//**
*
* Return true of channel is differential, else false.
*
* \param base
* Pointer to structure describing registers
*
* \param chan
* The channel to check, starting at 0.
*
* \return
* A false is return if chan is invalid.
*
* \funcusage
*
* \snippet sar/snippet/main.c SNIPPET_SAR_IS_CHANNEL_DIFF
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SAR_IsChannelDifferential(const SAR_Type *base, uint32_t chan)
{
    return !Cy_SAR_IsChannelSingleEnded(base, chan);
}
/** \} */

/** \addtogroup group_sar_functions_switches
* \{
*/
/*******************************************************************************
* Function Name: Cy_SAR_SetVssaVminusSwitch
****************************************************************************//**
*
* Open or close the switch between VSSA and Vminus of the SARADC through firmware.
* This function calls \ref Cy_SAR_SetAnalogSwitch with switchSelect set to
* \ref CY_SAR_MUX_SWITCH0 and switchMask set to SAR_MUX_SWITCH0_MUX_FW_VSSA_VMINUS_Msk.
*
* \param base
* Pointer to structure describing registers
*
* \param state
* Open or close the switch. Select a value from \ref cy_en_sar_switch_state_t.
*
* \return None
*
* \funcusage
*
* \snippet sar/snippet/main.c SNIPPET_SAR_VSSA_VMINUS_SWITCH
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR_SetVssaVminusSwitch(SAR_Type *base, cy_en_sar_switch_state_t state)
{
    Cy_SAR_SetAnalogSwitch(base, CY_SAR_MUX_SWITCH0, SAR_MUX_SWITCH0_MUX_FW_VSSA_VMINUS_Msk, state);
}


/*******************************************************************************
* Function Name: Cy_SAR_SetVssaSarSeqCtrl
****************************************************************************//**
*
* Enable or disable SARSEQ control of the switch between VSSA and Vminus of the SARADC.
* This function calls \ref Cy_SAR_SetSwitchSarSeqCtrl
* with switchMask set to SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_VSSA_Msk.
*
* \param base
* Pointer to structure describing registers
*
* \param ctrl
* Enable or disable control. Select a value from \ref cy_en_sar_switch_sar_seq_ctrl_t.
*
* \return None
*
* \funcusage
*
* \snippet sar/snippet/main.c SNIPPET_SAR_VSSA_SARSEQ_CTRL
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR_SetVssaSarSeqCtrl(SAR_Type *base, cy_en_sar_switch_sar_seq_ctrl_t ctrl)
{
    Cy_SAR_SetSwitchSarSeqCtrl(base, SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_VSSA_Msk, ctrl);
}
/** \} */


/** \addtogroup group_sar_functions_lp
* \{
*/


/*******************************************************************************
* Function Name: Cy_SAR_ScanCountDisable
****************************************************************************//**
*
* Disables the Scanning Counter.
*
* \param base
* Pointer to the structure of SAR instance registers.
*
* \funcusage \snippet sar/snippet/main.c SNIPPET_SAR_DS
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR_ScanCountDisable(const SAR_Type  *base)
{
    if (!CY_PASS_V1)
    {
        uint32_t interruptState = Cy_SysLib_EnterCriticalSection();
        PASS_SAR_OVR_CTRL(CY_PASS_V2_ADDR) &= ~(CY_SAR_INSTANCE_MASK(base) << PASS_V2_SAR_OVR_CTRL_TR_SCAN_CNT_SEL_Pos);
        Cy_SysLib_ExitCriticalSection(interruptState);
    }
}


/*******************************************************************************
* Function Name: Cy_SAR_SelectClock
****************************************************************************//**
*
* Switch the SAR input clock source.
* Suitable for PASS_V2 only.
* In case of CY_SAR_CLK_DEEPSLEEP it enables SAR operation in Deep Sleep mode.
*
* \param base
* Pointer to the structure of SAR instance registers.
*
* \param clock
* The SAR clock source \ref cy_en_sar_clock_source_t.
*
* \funcusage \snippet sar/snippet/main.c SNIPPET_SAR_DS
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR_SelectClock(const SAR_Type * base, cy_en_sar_clock_source_t clock)
{
    CY_ASSERT_L1(!CY_PASS_V1); /* Deep Sleep Clock is not supported */

    if (!CY_PASS_V1)
    {
        CY_ASSERT_L3(CY_SAR_IS_CLK_VALID(clock));
        PASS_SAR_CLOCK_SEL(base) = _VAL2FLD(PASS_V2_SAR_CLOCK_SEL_CLOCK_SEL, clock);
        PASS_SAR_DPSLP_CTRL(base) = _BOOL2FLD(PASS_V2_SAR_DPSLP_CTRL_ENABLED, (CY_SAR_CLK_DEEPSLEEP == clock));
    }
}
/** \} */


/** \addtogroup group_sar_functions_fifo
* \{
*/

/*******************************************************************************
* Function Name: Cy_SAR_FifoRead
****************************************************************************//**
*
* Reads FIFO word-by-word.
*
* \return Subsequent data sample
*
* \funcusage \snippet sar/snippet/main.c SNIPPET_FIFO
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR_FifoRead(const SAR_Type * base, cy_stc_sar_fifo_read_t * readStruct)
{
    CY_ASSERT_L1(!CY_PASS_V1); /* FIFO is not supported */

    if(!CY_PASS_V1)
    {
        uint32_t locReg = PASS_FIFO_RD_DATA(base);
        readStruct->channel = (uint16_t)_FLD2VAL(PASS_FIFO_V2_RD_DATA_CHAN_ID, locReg);
        readStruct->value  = (uint16_t)_FLD2VAL(PASS_FIFO_V2_RD_DATA_RESULT, locReg);
    }
}


/*******************************************************************************
* Function Name: Cy_SAR_FifoGetDataCount
****************************************************************************//**
*
* Returns a number of non-empty FIFO cells.
*
* \return Number of FIFO samples.
*
* \funcusage \snippet sar/snippet/main.c SNIPPET_FIFO
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SAR_FifoGetDataCount(const SAR_Type * base)
{
    uint32_t retVal = 0UL;

