RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_sar.h
    CY_ASSERT_L1(!CY_PASS_V1); /* FIFO is not supported */

    if(!CY_PASS_V1)
    {
        retVal = PASS_FIFO_USED(base);
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SAR_ClearFifoInterrupt
****************************************************************************//**
*
* Clear the FIFO interrupt.
* The interrupt must be cleared with this function so that the hardware
* can set subsequent interrupts and those interrupts can be forwarded
* to the interrupt controller, if enabled.
*
* \param base
* Pointer to structure describing registers
*
* \param intrMask
* The mask of interrupts to clear. Typically this will be the value returned
* from \ref Cy_SAR_GetFifoInterruptStatus.
* Alternately, select one or more values from \ref group_sar_macros_interrupt and "OR" them together.
* - \ref CY_SAR_INTR_FIFO_LEVEL
* - \ref CY_SAR_INTR_FIFO_OVERFLOW
* - \ref CY_SAR_INTR_FIFO_UNDERFLOW
*
* \return None
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR_ClearFifoInterrupt(const SAR_Type * base, uint32_t intrMask)
{
    CY_ASSERT_L1(!CY_PASS_V1); /* FIFO is not supported */

    if(!CY_PASS_V1)
    {
        CY_ASSERT_L2(CY_SAR_FIFO_INTRMASK(intrMask));
        PASS_FIFO_INTR(base) = intrMask & CY_SAR_INTR_FIFO;
        (void) PASS_FIFO_INTR(base); /* Dummy read for buffered writes. */
    }
}


/*******************************************************************************
* Function Name: Cy_SAR_SetFifoInterrupt
****************************************************************************//**
*
* Trigger an interrupt with software.
*
* \param base
* Pointer to structure describing registers
*
* \param intrMask
* The mask of interrupts to set.
* Select one or more values from \ref group_sar_macros_interrupt and "OR" them together.
* - \ref CY_SAR_INTR_FIFO_LEVEL
* - \ref CY_SAR_INTR_FIFO_OVERFLOW
* - \ref CY_SAR_INTR_FIFO_UNDERFLOW
*
* \return None
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR_SetFifoInterrupt(const SAR_Type * base, uint32_t intrMask)
{
    CY_ASSERT_L1(!CY_PASS_V1); /* FIFO is not supported */

    if(!CY_PASS_V1)
    {
        CY_ASSERT_L2(CY_SAR_FIFO_INTRMASK(intrMask));
        PASS_FIFO_INTR_SET(base) = intrMask & CY_SAR_INTR_FIFO;
    }
}


/*******************************************************************************
* Function Name: Cy_SAR_SetFifoInterruptMask
****************************************************************************//**
*
* Enable which interrupts can trigger the CPU interrupt controller.
*
* \param base
* Pointer to structure describing registers
*
* \param intrMask
* The mask of interrupts. Select one or more values from \ref group_sar_macros_interrupt
* and "OR" them together:
* - \ref CY_SAR_INTR_FIFO_LEVEL
* - \ref CY_SAR_INTR_FIFO_OVERFLOW
* - \ref CY_SAR_INTR_FIFO_UNDERFLOW
*
* \return None
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR_SetFifoInterruptMask(const SAR_Type * base, uint32_t intrMask)
{
    CY_ASSERT_L1(!CY_PASS_V1); /* FIFO is not supported */

    if(!CY_PASS_V1)
    {
        CY_ASSERT_L2(CY_SAR_FIFO_INTRMASK(intrMask));
        PASS_FIFO_INTR_MASK(base) = intrMask & CY_SAR_INTR_FIFO;
    }
}


/*******************************************************************************
* Function Name: Cy_SAR_GetFifoInterruptStatus
****************************************************************************//**
*
* Return the interrupt register status.
*
* \param base
* Pointer to structure describing registers
*
* \return Interrupt status \ref group_sar_macros_interrupt.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SAR_GetFifoInterruptStatus(const SAR_Type * base)
{
    uint32_t retVal = 0UL;

    CY_ASSERT_L1(!CY_PASS_V1); /* FIFO is not supported */

    if(!CY_PASS_V1)
    {
        retVal = PASS_FIFO_INTR(base);
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SAR_GetFifoInterruptMask
****************************************************************************//**
*
* Return which interrupts can trigger the CPU interrupt controller
* as configured by \ref Cy_SAR_SetFifoInterruptMask.
*
* \param base
* Pointer to structure describing registers
*
* \return
* Interrupt mask. Compare this value with masks in \ref group_sar_macros_interrupt.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SAR_GetFifoInterruptMask(const SAR_Type * base)
{
    uint32_t retVal = 0UL;

    CY_ASSERT_L1(!CY_PASS_V1); /* FIFO is not supported */

    if(!CY_PASS_V1)
    {
        retVal = PASS_FIFO_INTR_MASK(base);
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SAR_GetFifoInterruptStatusMasked
****************************************************************************//**
*
* Return the bitwise AND between the interrupt request and mask registers.
* See \ref Cy_SAR_GetFifoInterruptStatus and \ref Cy_SAR_GetFifoInterruptMask.
*
* \param base
* Pointer to structure describing registers
*
* \return
* Bitwise AND of the interrupt request and mask registers \ref group_sar_macros_interrupt.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SAR_GetFifoInterruptStatusMasked(const SAR_Type * base)
{
    uint32_t retVal = 0UL;

    CY_ASSERT_L1(!CY_PASS_V1); /* FIFO is not supported */

    if(!CY_PASS_V1)
    {
        retVal = PASS_FIFO_INTR_MASKED(base);
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SAR_FifoSetLevel
****************************************************************************//**
*
* Sets the FIFO trigger level which specifies how many samples FIFO should
* contain in order to generate trigger event.
*
* \param base
* Pointer to structure describing registers
*
* \param level The FIFO trigger level to be set. Range: 1..256.
*
* \return None
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR_FifoSetLevel(const SAR_Type *base, uint32_t level)
{
    CY_ASSERT_L1(!CY_PASS_V1); /* FIFO is not supported */

    if(!CY_PASS_V1)
    {
        uint32_t locLevel = level - 1UL; /* Convert the user value into the machine value */
        CY_ASSERT_L2(CY_SAR_IS_FIFO_LEVEL_VALID(level));
        PASS_FIFO_LEVEL(base) = _VAL2FLD(PASS_FIFO_V2_LEVEL_LEVEL, locLevel);
    }
}

